{"meta":{"title":"Elements of Harmony MOD | XUOGROUP","subtitle":"To bring six elements of harmony into Minecraft!","description":"","author":"XUOGROUP","url":"https://eoh.xuogroup.top","root":"/"},"pages":[{"title":"About","date":"2020-05-19T11:16:22.000Z","updated":"2020-05-20T04:59:50.240Z","comments":true,"path":"about/index.html","permalink":"https://eoh.xuogroup.top/about/index.html","excerpt":"","text":"This is the About Page on this website. About XUOGROUPXUOGROUP is a game development organization which was found in Mar. 2019. We have developed several games: XUO Series (Not released) Minecraft MOD: Elements of Harmony (This) Not much (maybe only a few), since we don’t have much experience, but trust us, soon (but not yet), you will find an amazing game which is made by us! Cross my heart and hope to fly, stick a cupcake in my eye! Most of these games are (or will be) released under a GNU General Public License, yes, we develop free games more than commercial games. Want to contact us? Public Inbox Protected Inbox Private Inbox GitHub XUOGROUP is a non-profit organization. About My Little PonyNotice: This page is translated by machine. Copied from WikiPedia. My Little Pony is a toy line and media franchise mainly targeting girls, developed by American toy company Hasbro. The first toys were developed by Bonnie Zacherle, Charles Muenchinger, and Steve D’Aguanno, and were produced in 1981. The ponies feature colorful bodies, manes and a unique symbol on one or both sides of their flanks. Such symbols are referred to in the two most recent incarnations as “cutie marks”. My Little Pony has been revamped several times with new and more modern looks to continue its appeal to the market. Following the original My Pretty Pony toy that was introduced in 1981, My Little Pony was launched in 1982 and the line became popular during the 1980s. The original toy line ran from 1982 to 1992 in the United States and to 1995 globally, and two animated specials, an animated feature-length film and two animated television series produced during the period up until 1992. The first incarnation’s popularity peaked in 1990, but the following year Hasbro decided to discontinue the toy line due to increased competition. One hundred fifty million ponies were sold in the 1980s. The toy line was revived in 1997, but these toys proved unpopular and were discontinued in 1999. The brand saw a more popular revival in 2003 with toys that more closely resembled the original toy line,which sold approximately 100 million pony toys globally by 2010. Hasbro launched the fourth incarnation of the franchise in 2010, which started with the animated series My Little Pony: Friendship Is Magic, which has ended since October 12, 2019. The brand grossed over $650 million in retail sales in 2013, and over $1 billion annually in retail sales in 2014 and 2015. Text is available under the Creative Commons Attribution-ShareAlike License; additional terms may apply. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization. About Copyright Minecraft © Mojang AB My Little Pony: Friendship Is Magic © Hasbro, Inc. 3D text for Elements of Harmony design © xuogroup.top Background picture for site cover design © Hasbro, Inc. Six pictures of Item Jewelry in the MOD © Hasbro, Inc. Other artwork in the MOD © xuogroup.top Site generate © hexo.io Pages service © GitHub, Inc. Fonts design © Apple, Inc. © Microsoft Corporation Icons design © Font Awesome Hexo theme Volantis © Mr. X Site Articles © xuogroup.top The Copyright Law of the People’s Republic of China provides that: Article 22. A work may be used without permission or payment of remuneration to the copyright owner under the following circumstances, provided that the name of the author and the title of the work shall be specified and the other rights enjoyed by the copyright owner in accordance with this law shall not be infringed: (1) To use a published work of another for his own study, research or appreciation; (The following has been omitted) Notice: The above is machine translation. This MOD is for personal use only. At your own risk if used for commercial purposes! Text is available under the GNU Free Documentation License. This MOD is licensed under the GNU General Public License. This MOD is a free software. My Little Pony® and Friendship Is Magic™ are (registered) trademarks of Hasbro, Inc.. Minecraft® is a registered trademark of Mojang Synergies AB. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc. If there is infringement, please contact us in time to deal with it."},{"title":"","date":"2020-05-29T10:40:01.186Z","updated":"2020-05-29T10:40:01.186Z","comments":true,"path":"interface/mod.json","permalink":"https://eoh.xuogroup.top/interface/mod.json","excerpt":"","text":"{\"homepage\":\"https://eoh.xuogroup.top\",\"1.15.2\":{\"0.9.0-alpha\":\"The first release, not fully-featured.\",\"0.9.0-beta\":\"Add recipes, still not fully-featured.\",\"1.0.0\":\"The first stable release.\",\"1.1.0\":\"A more interesting version.\"},\"promos\":{\"1.15.2-latest\":\"1.1.0\",\"1.15.2-recommended\":\"1.1.0\"}}"},{"title":"Download Page","date":"2020-05-23T12:02:14.000Z","updated":"2020-06-25T02:46:35.359Z","comments":true,"path":"download/index.html","permalink":"https://eoh.xuogroup.top/download/index.html","excerpt":"","text":"Hi there! This is the download page of Elements of Harmony. Download the latestLatest Release: RELEASE 1.2.0 Download From GitHub This version added more biomes. It is recommended for every player to update. Download the recommendedRecommended Release: RELEASE 1.2.0 Download From GitHub This version added more biomes. It is recommended for every player to update. All releasesDownload them from GitHub! Type Version Release Date Release 1.2.0 2020 06 25 Snapshot 1.1.0 2020 05 29 Release 1.0.0 2020 05 23 Preview 0.9.0-beta 2020 05 19 Preview 0.9.0-alpha 2020 05 16"}],"posts":[{"title":"Welcome!","slug":"welcome","date":"2020-05-18T06:16:32.000Z","updated":"2020-05-18T13:13:36.213Z","comments":true,"path":"welcome/","link":"","permalink":"https://eoh.xuogroup.top/welcome/","excerpt":"Hi there! If this is your first time to this website, read this page to learn about Elements of Harmony and us, XUOGROUP. If not, just continue your reading, have a nice day!","text":"Hi there! If this is your first time to this website, read this page to learn about Elements of Harmony and us, XUOGROUP. If not, just continue your reading, have a nice day! Hello for your visiting this instruction page. This is Andy-K-Sparklight speaking. You may feel strange about my avatar, that’s because… Andy has a crush on Rainbow Dash! Nope, not at all. (That must be Fish Chan) Elements of Harmony, just like it’s name, is a Minecraft MOD, and, obviously, is inspired of My Little Pony: Friendship Is Magic. This MOD, which is build with Forge API, inserts six Elements of Harmony into Minecraft. These elements are: Loyalty Laughter Generosity Honesty Kindness Magic (They are arranged in the order in My Little Pony Theme Song) All we want to do is to make Minecraft as close as possible to Equestria, and Elements of Harmony is an essential part. It includes: Six Elements, including their various forms. Advancements of your life in Minecraft. (Not Featured) A (or more) Dimension(s) for Equestria. (Not Featured) Basic Support for further development. (Not Featured) Yes, we’re still in progress, you can Watch, Star our repo on GitHub. Feel free to open an Issue or a Pull Request! About us: XUOGROUP has following members now (still appending): Andy K Sparklight (AG), the leader and the main author &amp; developer. Fish Chan(CSY), the supporter. K Twily, a cute child who always has some questions. Want to join or help? Mail to us: Private Inbox Public Inbox OK, that’s all, thank you for reading!","categories":[],"tags":[]}],"categories":[],"tags":[]}